NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
/* Copyright (c) 2010 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

#include <nrf_error.h>

#include "transport.h"
#include "transport_internal.h"

#include "utils.h"
#include "log.h"
#include "enc.h"
#include "event.h"
#include "nrf_mesh.h"
#include "network.h"
#include "net_state.h"
#include "replay_cache.h"
#include "internal_event.h"
#include "timer_scheduler.h"
#include "bearer_event.h"
#include "toolchain.h"
#include "nrf_mesh_assert.h"
#include "nrf_mesh_utils.h"
#include "nrf_mesh_externs.h"
#include "packet_mesh.h"
#include "mesh_mem.h"

#if MESH_FEATURE_LPN_ENABLED
#include "mesh_lpn.h"
#include "mesh_lpn_internal.h"
#endif

#if MESH_FEATURE_FRIEND_ENABLED
#include "friend_internal.h"
#endif

/* Note on replay protection implementation:
 *
 * Each incoming transport layer packet is checked against the replay list to prevent receiving the
 * same message twice. In addition, the seqzero of an incoming SAR session is checked when the SAR
 * session gets allocated. This is to prevent a SAR session from being received twice over different
 * network packets. It can't be checked later than allocation, as there might be unsegmented packets
 * coming in before all segments are received, which would make us wrongly abandon the SAR session.
 *
 * Packets are only added to the replay protection list once they've been successfully processed in
 * upper transport. This implies that all SAR segments are (implicitly) added only when upper
 * transport has processed the full SAR message. Note that SAR segments for messages we've already
 * processed in upper transport are added retroactively. Messages that aren't processed successfully
 * in upper transport aren't added to the replay protection list.
 *
 * Messages that are only destined for the friend module will not be added to replay protection, but
 * their SAR sessions will be marked as handled, as the friend node is responsible for acking the
 * transaction. The friend module itself can handle duplicates as long as the packets are still in
 * the friend queue.
 */

/*********************
 * Local definitions *
 *********************/

/** Mask for SeqZero value. */
#define TRANSPORT_SAR_SEQZERO_MASK (TRANSPORT_SAR_SEQNUM_DIFF_MAX)
#define TRANSPORT_SAR_SEGMENT_COUNT_MAX 32
#define TRANSPORT_SAR_PDU_LEN(control) ((control) ? PACKET_MESH_TRS_SEG_CONTROL_PDU_MAX_SIZE : PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE)
#define TRANSPORT_SAR_PACKET_MAX_SIZE(control) (TRANSPORT_SAR_SEGMENT_COUNT_MAX * TRANSPORT_SAR_PDU_LEN(control))
#define TRANSPORT_UNSEG_PDU_LEN(control) ((control) ? PACKET_MESH_TRS_UNSEG_CONTROL_PDU_MAX_SIZE : PACKET_MESH_TRS_UNSEG_ACCESS_PDU_MAX_SIZE)

#define TRANSPORT_SAR_RX_CACHE_LEN_MASK    (TRANSPORT_SAR_RX_CACHE_LEN - 1)

NRF_MESH_STATIC_ASSERT(IS_POWER_OF_2(TRANSPORT_SAR_RX_CACHE_LEN));
/* The SEQZERO mask must be (power of two - 1) to work as a mask (ie if a bit in the mask is set to
 * 1, all lower bits must also be 1). */
NRF_MESH_STATIC_ASSERT(IS_POWER_OF_2(TRANSPORT_SAR_SEQZERO_MASK + 1));
/* Checks whether the maximum access payload is according to 3.7.3 Access payload */
NRF_MESH_STATIC_ASSERT(NRF_MESH_SEG_PAYLOAD_SIZE_MAX == TRANSPORT_SAR_SEGMENT_COUNT_MAX * PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE -
                       PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE);
/* Checks whether the maximum unsegmented access payload is according to 3.7.3 Access payload */
NRF_MESH_STATIC_ASSERT(NRF_MESH_UNSEG_PAYLOAD_SIZE_MAX == PACKET_MESH_TRS_UNSEG_ACCESS_PDU_MAX_SIZE - PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE);
NRF_MESH_STATIC_ASSERT(TRANSPORT_SAR_SESSIONS_MAX > 1);

/*********************
 * Local types *
 *********************/

/**
 * Transport configuration struct.
 *
 * @note All timing values are given in microseconds.
 */
typedef struct
{
    timestamp_t rx_timeout;                /**< Timeout for receiving a SAR message. */
    timestamp_t rx_ack_base_timeout;       /**< RX acknowledgment timer timeout value. */
    timestamp_t rx_ack_per_hop_addition;   /**< RX acknowledgment time delay added per hop in the transmission. */
    timestamp_t tx_retry_base_timeout;     /**< Base timeout for TX retries.*/
    timestamp_t tx_retry_per_hop_addition; /**< TX retry time added per hop in the transmission. */
    uint8_t tx_retries;                    /**< Number of retries before canceling SAR session. */
    uint8_t segack_ttl;                    /**< Default TTL value for segment acknowledgment messages. */
    nrf_mesh_transmic_size_t szmic;        /**< Use 32- or 64-bit MIC for application payload. */
} transport_config_t;

/**
 * Transport SAR session types.
 */
typedef enum
{
    TRS_SAR_SESSION_INACTIVE,   /**< The session isn't active. */
    TRS_SAR_SESSION_TX,         /**< TX session. */
    TRS_SAR_SESSION_RX          /**< RX session. */
} trs_sar_session_t;

/** State of the SAR RX session ack. */
typedef enum
{
    SAR_ACK_STATE_IDLE,   /**< No acking in progress. */
    SAR_ACK_STATE_TIMER_ACTIVE, /**< Timer is waiting to fire */
    SAR_ACK_STATE_PENDING /**< An ack packet should be sent at the first opportunity. */
} sar_ack_state_t;

#if MESH_FEATURE_LPN_ENABLED
typedef enum
{
    SAR_TIMEOUT_STATE_IDLE,
    SAR_TIMEOUT_STATE_ACTIVE,
    SAR_TIMEOUT_STATE_WAIT_POLL_COMPLETE
} sar_timeout_state_t;
#endif

/**
 * Transport SAR PDU structure.
 *
 * @note All multi-octet values are assumed *little* endian.
 */
typedef struct
{
    transport_packet_metadata_t metadata;
    /** Timer used to resend or abort the SAR session. */
    timer_event_t timer_event;
#if MESH_FEATURE_LPN_ENABLED
    sar_timeout_state_t timeout_state;
#endif
    /** Transport SAR session header. */
    struct
    {
        trs_sar_session_t session_type; /**< SAR session type. */
        uint16_t length;                /**< Total length of the session data (payload + mic). */
        uint32_t block_ack;             /**< Bit-field of the acknowledged segments. */
        union
        {
            /** Fields that are only valid for TX-sessions. */
            struct
            {
                uint8_t  start_index;           /**< Segment index to start transmitting from. Used to recover from out-of-memory errors. */
                uint8_t  retries;               /**< Number of retries left. */
                bool payload_encrypted;         /**< Flag indicating whether the payload has been encrypted. */
                bool seqzero_is_set;            /**< Flag indicating whether the seqzero has been set. */
                nrf_mesh_tx_token_t token;      /**< TX Token set by the user. */
                /** Source address of the device that acked the packet. Must be the same for every
                 * ack, according to Mesh Profile Specification v1.0 section 3.5.3.3. */
                uint16_t ack_src;
            } tx;
            /** Fields that are only valid for RX-sessions */
            struct
            {
                /** Acknowledgment timer */
                timer_event_t ack_timer;
                sar_ack_state_t ack_state;
            } rx;
        } params;
    } session;
    /**
    * Re-segmented SAR payload with 4 byte MIC at the end.
    */
    uint8_t * payload;
} trs_sar_ctx_t;

/** Completed SAR session, used to cache previous successful sessions. */
typedef struct
{
    uint16_t src;
    transport_packet_receiver_t receivers; /**< Who received the session. */
    uint64_t seqauth;
} completed_sar_session_t;

/** A consumer of control packets. */
typedef struct
{
    const transport_control_packet_handler_t * p_handlers; /**< List of opcodes and their handler functions. */
    uint32_t handler_count; /**< Number of handlers. */
} control_packet_consumer_t;
