NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
/********************
 * Static variables *
 ********************/

static transport_config_t m_trs_config;
static trs_sar_ctx_t m_trs_sar_sessions[TRANSPORT_SAR_SESSIONS_MAX];
#if MESH_FEATURE_LPN_ENABLED
static uint8_t m_trs_sar_lpn_buffer[NRF_MESH_UPPER_TRANSPORT_PDU_SIZE_MAX];
#endif
static uint32_t m_sar_session_cache_head;
static completed_sar_session_t m_sar_session_cache[TRANSPORT_SAR_RX_CACHE_LEN];

/** Flag used to trigger SAR processing. */
static bearer_event_flag_t m_sar_process_flag;

static control_packet_consumer_t m_control_packet_consumers[TRANSPORT_CONTROL_PACKET_CONSUMERS_MAX];
static uint32_t m_control_packet_consumer_count;
/********************
 * Static functions *
 ********************/

static void ack_timeout(timestamp_t timestamp, void * p_context);
static void retry_timeout(timestamp_t timestamp, void * p_context);
static void abort_timeout(timestamp_t timestamp, void * p_context);

#if MESH_FEATURE_LPN_ENABLED
static bool sar_payload_is_heap_allocated(trs_sar_ctx_t * p_sar_ctx)
{
    return ((intptr_t) p_sar_ctx->payload != (intptr_t) &m_trs_sar_lpn_buffer[0]);
}
#endif

static inline bool is_in_lpn_role(void)
{
#if MESH_FEATURE_LPN_ENABLED
    return mesh_lpn_is_in_friendship();
#else
    return false;
#endif
}

static inline uint32_t block_ack_full(const transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT(p_metadata->segmented);
    return ((1u << (p_metadata->segmentation.last_segment + 1)) - 1);
}
static void upper_transport_packet_in(const uint8_t * p_upper_trs_packet,
                                      uint32_t upper_trs_packet_len,
                                      transport_packet_metadata_t * p_metadata,
                                      const nrf_mesh_rx_metadata_t * p_rx_metadata);

static uint32_t seqauth_sequence_number_get(uint32_t seqnum, uint16_t seqzero)
{
    if ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) < seqzero)
    {
        return ((seqnum - ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) - seqzero) - (TRANSPORT_SAR_SEQZERO_MASK + 1)));
    }
    else
    {
        return ((seqnum - ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) - seqzero)));
    }
}

/**
 * Get the SeqAuth value of the given metadata.
 *
 * The SeqAuth is a 56 bit value, compromised of the IV index and SeqZero sequence number:
 *
 * |  |  |  |  |  |  |  |
 * |56       24|23     0|
 * | IV Index  | SeqNum |
 *
 * The SeqAuth can be used to compare two SAR segments from the same source to determine which was sent first.
 *
 * @param[in] p_metadata Metadata to compute SeqAuth of.
 *
 * @returns The SeqAuth of the given metadata.
 */
static uint64_t seqauth_get(const transport_packet_metadata_t * p_metadata)
{
    // SeqAuth only makes sense for segmented messages
    NRF_MESH_ASSERT_DEBUG(p_metadata->segmented);

    return ((uint64_t) p_metadata->net.internal.iv_index << NETWORK_SEQNUM_BITS) +
           seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                       p_metadata->segmentation.seq_zero);
}

static void m_send_replay_cache_full_event(uint16_t src, uint8_t ivi, nrf_mesh_rx_failed_reason_t reason)
{
    nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_RX_FAILED,
            .params.rx_failed.src = src,
            .params.rx_failed.ivi = ivi,
            .params.rx_failed.reason = reason
        };
    event_handle(&evt);
}

static uint32_t replay_list_add(const transport_packet_metadata_t * p_metadata)
{
    uint32_t status = replay_cache_add(p_metadata->net.src,
                                       p_metadata->net.internal.sequence_number,
                                       p_metadata->net.internal.iv_index);
    if (status != NRF_SUCCESS)
    {
        m_send_replay_cache_full_event(p_metadata->net.src,
                                       p_metadata->net.internal.iv_index & NETWORK_IVI_MASK,
                                       NRF_MESH_RX_FAILED_REASON_REPLAY_CACHE_FULL);
    }
    return status;
}

static void m_send_sar_cancel_event(nrf_mesh_tx_token_t token, nrf_mesh_sar_session_cancel_reason_t reason)
{
    nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_SAR_FAILED,
            .params.sar_failed.token = token,
            .params.sar_failed.reason = reason
        };
    event_handle(&evt);
}

static inline uint32_t rx_ack_timer_delay_get(uint8_t ttl)
{
    return m_trs_config.rx_ack_base_timeout + m_trs_config.rx_ack_per_hop_addition * ttl;
}

static inline uint32_t tx_retry_timer_delay_get(uint8_t ttl)
{
    return m_trs_config.tx_retry_base_timeout + m_trs_config.tx_retry_per_hop_addition * ttl;
}

/**
 * Check whether the RX SAR session has been handled before.
 *
 * @param[in] p_metadata Metadata to check for.
 *
 * @returns A pointer to the completed session, or NULL if no session was found.
 */
static const completed_sar_session_t * sar_rx_completed_session_find(const transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT(p_metadata->segmented);

    uint64_t seqauth = seqauth_get(p_metadata);
    uint16_t src = p_metadata->net.src;

    for (uint32_t i = 0; i < TRANSPORT_SAR_RX_CACHE_LEN; ++i)
    {
        if (src == m_sar_session_cache[i].src && seqauth == m_sar_session_cache[i].seqauth)
        {
            return &m_sar_session_cache[i];
        }
    }
    return NULL;
}

/**
 * Places a completed SAR session into the session cache.
 *
 * @param[in] p_metadata SAR metadata handled.
 * @param[in] successful Flag indicating whether the session was successfully received or not.
 */
static void sar_rx_session_mark_as_handled(const transport_packet_metadata_t * p_metadata, bool successful)
{
    NRF_MESH_ASSERT(p_metadata->segmented);

    /* Wipe any existing sessions from this source from the cache, as we shouldn't respond to
     * older sessions.
     */
    for (uint32_t i = 0; i < TRANSPORT_SAR_RX_CACHE_LEN; ++i)
    {
        if (p_metadata->net.src == m_sar_session_cache[i].src)
        {
            m_sar_session_cache[i].src = NRF_MESH_ADDR_UNASSIGNED;
            break;
        }
    }

    completed_sar_session_t * p_completed_session =
        &m_sar_session_cache[m_sar_session_cache_head++ & TRANSPORT_SAR_RX_CACHE_LEN_MASK];

    p_completed_session->src = p_metadata->net.src;
    p_completed_session->receivers = (successful ? p_metadata->receivers : TRANSPORT_PACKET_RECEIVER_NONE);
    p_completed_session->seqauth = seqauth_get(p_metadata);
}

/**
 * Allocate the given SAR context with the given parameters.
 *
 * @param[in] p_metadata Metadata to use in the context.
 * @param[in] session_type Type of session.
 * @param[in] length Length of SAR data, including MIC.
 *
 * @returns pointer to allocated context if successful. NULL otherwise.
 */
static trs_sar_ctx_t * sar_ctx_alloc(const transport_packet_metadata_t * p_metadata,
                                     trs_sar_session_t session_type,
                                     uint32_t length)
{
    NRF_MESH_ASSERT_DEBUG(session_type == TRS_SAR_SESSION_RX ||
                          session_type == TRS_SAR_SESSION_TX);
    NRF_MESH_ASSERT_DEBUG(length <= NRF_MESH_UPPER_TRANSPORT_PDU_SIZE_MAX);

    trs_sar_ctx_t * p_sar_ctx = NULL;
    uint32_t i = 0;
#if MESH_FEATURE_LPN_ENABLED
    /* Reserve one session for RX if LPN is enabled. */
    if (session_type == TRS_SAR_SESSION_TX)
    {
        i = 1;
    }
#endif
    for (; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_INACTIVE)
        {
            p_sar_ctx = &m_trs_sar_sessions[i];
#if MESH_FEATURE_LPN_ENABLED
            if (i == 0)
            {
                p_sar_ctx->payload = m_trs_sar_lpn_buffer;
            }
            else
#endif
            {
                p_sar_ctx->payload = mesh_mem_alloc(length);
            }
            break;
        }
    }

