NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    if (p_sar_ctx == NULL || p_sar_ctx->payload == NULL)
    {
        return NULL;
    }

    memcpy(&p_sar_ctx->metadata, p_metadata, sizeof(transport_packet_metadata_t));
    p_sar_ctx->session.block_ack = 0;
    p_sar_ctx->session.length = length;

    if (session_type == TRS_SAR_SESSION_TX)
    {
        p_sar_ctx->session.params.tx.retries = m_trs_config.tx_retries;
        p_sar_ctx->session.params.tx.payload_encrypted = false;
        p_sar_ctx->session.params.tx.seqzero_is_set = false;
        p_sar_ctx->session.params.tx.start_index = 0;
        /* Set the TX token to indicate a SAR packet, use the SAR-TX token to keep the user-token.
         * This way we'll know that we got a TX complete on a SAR packet, so we can forward the TX
         * complete when the entire SAR packet is done. */
        p_sar_ctx->session.params.tx.token = p_metadata->token;
        p_sar_ctx->session.params.tx.ack_src = NRF_MESH_ADDR_UNASSIGNED;
        p_sar_ctx->metadata.token = NRF_MESH_SAR_TOKEN;
        p_sar_ctx->timer_event.cb = retry_timeout;
        p_sar_ctx->timer_event.p_context = p_sar_ctx;
    }
    else
    {
        p_sar_ctx->metadata.token = NRF_MESH_SAR_TOKEN;
        p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_IDLE;
        p_sar_ctx->session.params.rx.ack_timer.cb = ack_timeout;
        p_sar_ctx->session.params.rx.ack_timer.p_context = p_sar_ctx;
        p_sar_ctx->timer_event.cb = abort_timeout;
        p_sar_ctx->timer_event.p_context = p_sar_ctx;
    }
    /* The IV index should stay the same for the duration of the session. */
    net_state_iv_index_lock(true);
    p_sar_ctx->session.session_type = session_type;
    return p_sar_ctx;
}

static void sar_ctx_free(trs_sar_ctx_t * p_sar_ctx)
{
#if MESH_FEATURE_LPN_ENABLED
    if (sar_payload_is_heap_allocated(p_sar_ctx))
#endif
    {
        mesh_mem_free(p_sar_ctx->payload);
    }

    /* Abort any ongoing timers. Timers may or may not be running depending on whether we're
     * entering, exiting or in a friendship. */
    timer_sch_abort(&p_sar_ctx->timer_event);

    if (p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX)
    {
        timer_sch_abort(&p_sar_ctx->session.params.rx.ack_timer);
    }

    memset(p_sar_ctx, 0, sizeof(trs_sar_ctx_t));
    p_sar_ctx->session.session_type = TRS_SAR_SESSION_INACTIVE;

    net_state_iv_index_lock(false);
}

static void sar_ctx_cancel(trs_sar_ctx_t * p_sar_ctx, nrf_mesh_sar_session_cancel_reason_t reason)
{
    NRF_MESH_ASSERT(p_sar_ctx != NULL);

    uint32_t seq = seqauth_sequence_number_get(p_sar_ctx->metadata.net.internal.sequence_number,
                                               p_sar_ctx->metadata.segmentation.seq_zero);
    (void) seq;
    __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_SAR_CANCELLED, reason, sizeof(uint32_t), &seq);

    /* For RX sessions, the friend needs to know what happened. */
#if MESH_FEATURE_FRIEND_ENABLED
    if (p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX &&
        p_sar_ctx->metadata.receivers & TRANSPORT_PACKET_RECEIVER_FRIEND)
    {
        friend_sar_complete(p_sar_ctx->metadata.net.src,
                            p_sar_ctx->metadata.segmentation.seq_zero,
                            false);
    }
#endif

    trs_sar_session_t type = p_sar_ctx->session.session_type;
    if (type == TRS_SAR_SESSION_RX)
    {
        /* Even failing sessions should be marked as handled so we know to ignore them if we receive
         * more segments for them later. */
        sar_rx_session_mark_as_handled(&p_sar_ctx->metadata, false);
    }


    m_send_sar_cancel_event(p_sar_ctx->session.params.tx.token, reason);
    sar_ctx_free(p_sar_ctx);

    __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Dropped SAR session %u, reason %u\n",
          p_sar_ctx->session.session_type, reason);
}

static void sar_ctx_tx_complete(trs_sar_ctx_t * p_sar_ctx)
{
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_TX);
    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_TX_COMPLETE;
    evt.params.tx_complete.token = p_sar_ctx->session.params.tx.token;
    event_handle(&evt);
    sar_ctx_free(p_sar_ctx);
    __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_SAR_SUCCESS, 0, 0, NULL);
}

static void ack_timer_reset(trs_sar_ctx_t * p_sar_ctx)
{
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX);
    uint32_t delay = rx_ack_timer_delay_get(m_trs_config.segack_ttl);
    timer_sch_reschedule(&p_sar_ctx->session.params.rx.ack_timer, timer_now() + delay);
    p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_TIMER_ACTIVE;
}

static void rx_incomplete_timer_reset(trs_sar_ctx_t * p_sar_ctx)
{
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX);
    uint32_t delay = m_trs_config.rx_timeout;
    timer_sch_reschedule(&p_sar_ctx->timer_event, timer_now() + delay);
}

static void tx_retry_timer_reset(trs_sar_ctx_t * p_sar_ctx)
{
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_TX);

    uint32_t next_timeout = timer_now();

    /* For non-unicast addresses, we're not going to get any acknowledgements, so there's no
     * point in scaling the retry interval according to TTL. */
    next_timeout += ((p_sar_ctx->metadata.net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST) ?
                     tx_retry_timer_delay_get(p_sar_ctx->metadata.net.ttl) :
                     tx_retry_timer_delay_get(0));

#if MESH_FEATURE_LPN_ENABLED
    p_sar_ctx->timeout_state = SAR_TIMEOUT_STATE_ACTIVE;
#endif
    timer_sch_reschedule(&p_sar_ctx->timer_event, next_timeout);
}

static void trs_packet_header_build(const transport_packet_metadata_t * p_metadata, packet_mesh_trs_packet_t * p_packet)
{
    if (p_metadata->net.control_packet)
    {
        packet_mesh_trs_control_opcode_set(p_packet, p_metadata->type.control.opcode);
    }
    else
    {
        packet_mesh_trs_access_akf_set(p_packet, p_metadata->type.access.using_app_key);
        packet_mesh_trs_access_aid_set(p_packet, p_metadata->type.access.app_key_id);
    }

    packet_mesh_trs_common_seg_set(p_packet, p_metadata->segmented);

