NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    if (p_metadata->segmented)
    {
        packet_mesh_trs_seg_szmic_set(p_packet, p_metadata->mic_size == PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE);
        packet_mesh_trs_seg_seqzero_set(p_packet, p_metadata->segmentation.seq_zero);
        packet_mesh_trs_seg_sego_set(p_packet, p_metadata->segmentation.segment_offset);
        packet_mesh_trs_seg_segn_set(p_packet, p_metadata->segmentation.last_segment);
    }
}

static uint32_t upper_trs_packet_alloc(transport_packet_metadata_t * p_metadata,
                                        network_tx_packet_buffer_t * p_net_buf,
                                        uint32_t transport_data_len,
                                        uint8_t ** pp_upper_trs_payload)
{
    uint32_t header_len = (p_metadata->segmented ?
                           PACKET_MESH_TRS_SEG_PDU_OFFSET :
                           PACKET_MESH_TRS_UNSEG_PDU_OFFSET);
    p_net_buf->user_data.payload_len = header_len + transport_data_len;
    p_net_buf->user_data.p_metadata = &p_metadata->net;
    p_net_buf->user_data.token = p_metadata->token;
    p_net_buf->user_data.bearer_selector = p_metadata->tx_bearer_selector;
    p_net_buf->user_data.role = CORE_TX_ROLE_ORIGINATOR;

    uint32_t status = network_packet_alloc(p_net_buf);
    if (status == NRF_SUCCESS)
    {
        *pp_upper_trs_payload = &p_net_buf->p_payload[header_len];
    }
    return status;
}

/**
 * Ack the SAR session.
 *
 * @note Enforces specification rule saying only to ack if the destination address is a unicast
 * address (Mesh Profile Specification v1.0, section 3.5.3.4).
 *
 * @param[in] p_metadata Metadata of the SAR session to ack.
 * @param[in] block_ack Ack bitfield value.
 *
 * @retval NRF_SUCCESS The ack was successful, or the session was not directed to a unicast address.
 * @retval NRF_ERROR_NO_MEM
 */
static uint32_t sar_ack_send(const transport_packet_metadata_t * p_metadata, uint32_t block_ack)
{
    /* We only ack on unicast packets */
    uint32_t status = NRF_SUCCESS;
    if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        packet_mesh_trs_control_packet_t packet_buffer;
        memset(&packet_buffer, 0, sizeof(packet_buffer));
        packet_mesh_trs_control_segack_seqzero_set(&packet_buffer, p_metadata->segmentation.seq_zero);
        packet_mesh_trs_control_segack_block_ack_set(&packet_buffer, block_ack);
        packet_mesh_trs_control_segack_obo_set(&packet_buffer, (p_metadata->receivers == TRANSPORT_PACKET_RECEIVER_FRIEND));

        transport_control_packet_t control_packet;
        control_packet.data_len           = PACKET_MESH_TRS_CONTROL_SEGACK_SIZE;
        control_packet.dst.type           = NRF_MESH_ADDRESS_TYPE_UNICAST;
        control_packet.dst.value          = p_metadata->net.src;
        control_packet.dst.p_virtual_uuid = NULL;
        control_packet.opcode             = TRANSPORT_CONTROL_OPCODE_SEGACK;
        control_packet.p_data             = &packet_buffer;
        control_packet.p_net_secmat       = p_metadata->net.p_security_material;
        control_packet.reliable           = false;
        control_packet.src                = p_metadata->net.dst.value;
        control_packet.bearer_selector    = p_metadata->tx_bearer_selector;
        if (p_metadata->net.ttl == 0)
        {
            /* Respond with TTL=0 to TTL=0 messages. (Mesh Profile Specification v1.0, section 3.5.2.3) */
            control_packet.ttl = 0;
        }
        else
        {
            control_packet.ttl = m_trs_config.segack_ttl;
        }

        status = transport_control_tx(&control_packet, NRF_MESH_SAR_TOKEN);

        if (status == NRF_SUCCESS)
        {
            __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_ACK_QUEUED, 0, PACKET_MESH_TRS_CONTROL_SEGACK_SIZE, &packet_buffer);
        }
    }
    return status;
}

static void sar_tx_session_end(trs_sar_ctx_t * p_sar_ctx)
{
    /* We're out of retries. Should give up. */
    if (p_sar_ctx->metadata.net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_REASON_RETRY_OVER);
    }
    else
    {
        /* For non-unicast addresses, timing out is considered a successful way to end, as there
         * are no acknowledgments. */
        sar_ctx_tx_complete(p_sar_ctx);
    }
}

static void sar_tx_session_continue(trs_sar_ctx_t * p_sar_ctx)
{
    if (p_sar_ctx->session.params.tx.retries > 0)
    {
        p_sar_ctx->session.params.tx.retries--;
        p_sar_ctx->session.params.tx.start_index = 0;
        /* Set bearer flag to trigger sending of remaining segments. */
        bearer_event_flag_set(m_sar_process_flag);
    }
    else
    {
        sar_tx_session_end(p_sar_ctx);
    }
}

static trs_sar_ctx_t * sar_active_tx_ctx_get(const transport_packet_metadata_t * p_metadata, uint16_t seq_zero)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX &&
            m_trs_sar_sessions[i].metadata.net.src == p_metadata->net.dst.value &&
            m_trs_sar_sessions[i].metadata.segmentation.seq_zero == seq_zero &&
            (m_trs_sar_sessions[i].session.params.tx.ack_src == NRF_MESH_ADDR_UNASSIGNED ||
             m_trs_sar_sessions[i].session.params.tx.ack_src == p_metadata->net.src))
        {
            return &m_trs_sar_sessions[i];
        }
    }

    return NULL;
}

static trs_sar_ctx_t * sar_active_rx_ctx_get(const transport_packet_metadata_t * p_metadata)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_RX &&
            m_trs_sar_sessions[i].metadata.net.src == p_metadata->net.src)
        {
            return &m_trs_sar_sessions[i];
        }
    }
    return NULL;
}

static bool sar_rx_seqauth_is_old(const transport_packet_metadata_t * p_metadata)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_RX &&
            m_trs_sar_sessions[i].metadata.net.src == p_metadata->net.src &&
            seqauth_get(p_metadata) < seqauth_get(&m_trs_sar_sessions[i].metadata))
        {
            return true;
        }
    }
    return false;
}


static void sar_rx_ctx_cancel_all(nrf_mesh_sar_session_cancel_reason_t reason)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_RX)
        {
            sar_ctx_cancel(&m_trs_sar_sessions[i], reason);
        }
    }
}

#if MESH_FEATURE_LPN_ENABLED
static void sar_tx_pending_retries_send(void)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; i++)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX &&
            m_trs_sar_sessions[i].timeout_state == SAR_TIMEOUT_STATE_WAIT_POLL_COMPLETE)
        {
            sar_tx_session_continue(&m_trs_sar_sessions[i]);
        }
    }
}

static void mesh_evt_handler(const nrf_mesh_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_LPN_FRIEND_POLL_COMPLETE:
            sar_rx_ctx_cancel_all(NRF_MESH_SAR_CANCEL_REASON_LPN_RX_NOT_COMPLETE);
            sar_tx_pending_retries_send();
            break;

        case NRF_MESH_EVT_FRIENDSHIP_TERMINATED:
            if (p_evt->params.friendship_terminated.role == NRF_MESH_FRIENDSHIP_ROLE_LPN)
            {
                sar_rx_ctx_cancel_all(NRF_MESH_SAR_CANCEL_REASON_FRIENDSHIP_TERMINATED);
                /* TODO: If the DST is unicast and we're not scanning ~100%, we might want to cancel any
                 * ongoing TX sessions (MBTLE-2825).  */
                sar_tx_pending_retries_send();
            }
            break;

