NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
        case NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED:
            if (p_evt->params.friendship_established.role == NRF_MESH_FRIENDSHIP_ROLE_LPN)
            {
                sar_rx_ctx_cancel_all(NRF_MESH_SAR_CANCEL_REASON_FRIENDSHIP_ESTABLISHED);
            }
            break;

        default:
            break;
    }
}
#endif  /* MESH_FEATURE_LPN_ENABLED */

/**
 * Get a SAR ctx for the given metadata.
 *
 * Checks that we're allowed to receive a SAR session with the given metadata, and searches for the
 * active session. If no active session exists for this src+seqzero combination, we'll create one.
 *
 * @param[in] p_metadata Metadata of a segment.
 *
 * @returns A pointer to a SAR context or NULL if the packet can't be received.
 */
static trs_sar_ctx_t * sar_rx_ctx_get(const transport_packet_metadata_t * p_metadata)
{
    /* From Mesh Profile Specification v1.0, Section 3.5.3.4: Segments with a lower SeqAuth
     * value than the most recent SeqAuth should be ignored. Note that this rule takes precendence
     * over all the others - we should never act on old messages. */
    if (sar_rx_seqauth_is_old(p_metadata))
    {
        if (is_in_lpn_role())
        {
            /* The Friend node should only send us segments for complete transactions. However, if
             * the Friend misbehaves, all we can do is ignore the segment. */
            __LOG(LOG_SRC_TRANSPORT,
                  LOG_LEVEL_WARN,
                  "Invalid segment from Friend (seqzero: %d)\n",
                  p_metadata->segmentation.seq_zero);
        }
        return NULL;
    }

    /* Check if we've received this session before. */
    const completed_sar_session_t * p_completed_session = sar_rx_completed_session_find(p_metadata);
    if (p_completed_session != NULL)
    {
        /* Need to override the metadata receivers, in case it has changed since the segment was
         * originally received, as the OBO flag depends on having the correct receiver. */
        transport_packet_metadata_t ack_meta = *p_metadata;
        ack_meta.receivers = p_completed_session->receivers;

        if (p_completed_session->receivers != TRANSPORT_PACKET_RECEIVER_NONE)
        {
            /* The sender likely missed our ack, we should resend it. */
            (void) sar_ack_send(&ack_meta, block_ack_full(&ack_meta));

            if (p_completed_session->receivers & TRANSPORT_PACKET_RECEIVER_SELF)
            {
                /* This message is now the newest segment of a successful SAR session, and should be added to the replay list. */
                (void) replay_list_add(p_metadata);
            }
        }
        return NULL;
    }

    /* Find ongoing session by src. */
    trs_sar_ctx_t * p_sar_ctx = sar_active_rx_ctx_get(p_metadata);

    if (NULL != p_sar_ctx && seqauth_get(p_metadata) > seqauth_get(&p_sar_ctx->metadata))
    {
        /* As segments on older SeqAuths are discarded, there's no point in keeping the old session
         * around. Its segments will only get rejected over and over until it times out. */
        sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_PEER_STARTED_ANOTHER_SESSION);
        p_sar_ctx = NULL;
    }

    if (NULL == p_sar_ctx)
    {
        /* Create new session */

        if (is_in_lpn_role())
        {
            /* The Friend node should prevent the scenario where we're starting a new session whilst
            * still receiving another one, but we'll cancel anything ongoing to be sure. */
            sar_rx_ctx_cancel_all(NRF_MESH_SAR_CANCEL_PEER_STARTED_ANOTHER_SESSION);
        }

        uint32_t total_length = ((p_metadata->segmentation.last_segment + 1) *
                                    TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet));
        if (total_length > TRANSPORT_SAR_PACKET_MAX_SIZE(p_metadata->net.control_packet))
        {
            __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_ERROR, "Invalid length: %u\n", total_length);
            return NULL;
        }

        /* The sar session shouldn't be started if it's already in the replay protection list, as
         * that could allow a spoofing device to replay it with higher segment seqnums. */
        uint32_t seq = seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                                   p_metadata->segmentation.seq_zero);
        if (!replay_cache_has_elem(p_metadata->net.src, seq, p_metadata->net.internal.iv_index))
        {
            /* Try allocating the new session */
            p_sar_ctx = sar_ctx_alloc(p_metadata, TRS_SAR_SESSION_RX, total_length);

            if (p_sar_ctx == NULL)
            {
                /* We must assure that we always have room to receive a SAR message when in a
                * friendship as an LPN, so if we got here as an LPN, something is wrong in the implementation. */
                NRF_MESH_ASSERT_DEBUG(!is_in_lpn_role());

                /* Send block ack=0 to indicate failure to receive. Transport is out of resources. */
                (void) sar_ack_send(p_metadata, 0);
                m_send_sar_cancel_event(NRF_MESH_INITIAL_TOKEN, NRF_MESH_SAR_CANCEL_REASON_NO_MEM);

                /* We do NOT add this message to the replay cache, as we hope to handle its SAR session
                * at a later point. Adding it would make us reject the SAR session later, as we're
                * checking for seqzero when we allocate it. */
            }
        }
        else
        {
            __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_PACKET_DROPPED,
                                  PACKET_DROPPED_REPLAY_CACHE,
                                  sizeof(uint32_t),
                                  &seq);
        }
    }
    return p_sar_ctx;
}

static void trs_seg_packet_in(const packet_mesh_trs_packet_t * p_packet,
                              uint32_t packet_len,
                              const transport_packet_metadata_t * p_metadata,
                              const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    trs_sar_ctx_t * p_sar_ctx = sar_rx_ctx_get(p_metadata);

    if (p_sar_ctx == NULL)
    {
        return;
    }
    __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Got segment %u\n", p_metadata->segmentation.segment_offset);

    /* In a friendship, the Friend shall put segments in its Friend Queue when the message has been
     * fully received/assembled (ref. Mesh Profile v1.0, sec. 3.5.5). If we still have an active RX
     * context on NRF_MESH_EVT_LPN_FRIEND_POLL_COMPLETE, we regard the session as failed. Thus no
     * need to start the incomplete timer. */
    if (!is_in_lpn_role())
    {
        /* Reset timers, even if we already received this segment. */
        rx_incomplete_timer_reset(p_sar_ctx);

        if (p_sar_ctx->metadata.net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST &&
            p_sar_ctx->session.params.rx.ack_state == SAR_ACK_STATE_IDLE)
        {
            ack_timer_reset(p_sar_ctx);
        }
    }

