NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    if (p_sar_ctx->session.block_ack & (1u << p_metadata->segmentation.segment_offset))
    {
        /* Segment already received. */
        return;
    }

    p_sar_ctx->session.block_ack |= (1u << p_metadata->segmentation.segment_offset);

    uint32_t segment_len    = packet_len - PACKET_MESH_TRS_SEG_PDU_OFFSET;
    uint32_t segment_offset = p_metadata->segmentation.segment_offset *
                              TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet);
    if (p_metadata->segmentation.segment_offset == p_sar_ctx->metadata.segmentation.last_segment)
    {
        /* Last segment might not be the full length of a normal segment, update total length */
        p_sar_ctx->session.length = segment_offset + segment_len;
    }
    else if (segment_len != TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet))
    {
        /* Got a non-conformant segment length, discard the packet. */
        sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_REASON_INVALID_FORMAT);
        return;
    }

    /* Adopt the network metadata of the segment that was sent last to maintain the correct sequence
     * number order in upper transport. This also ensures that once the packet is added to the
     * replay list, the entry covers them all. */
    if (p_sar_ctx->metadata.net.internal.sequence_number < p_metadata->net.internal.sequence_number)
    {
        p_sar_ctx->metadata.net = p_metadata->net;
    }

    memcpy(&p_sar_ctx->payload[segment_offset], packet_mesh_trs_seg_payload_get(p_packet), segment_len);

#if MESH_FEATURE_FRIEND_ENABLED
    // Now that all sanitizing checks have passed, we can send the packet to the friend module
    if (p_metadata->receivers & TRANSPORT_PACKET_RECEIVER_FRIEND)
    {
        friend_packet_in(p_packet, packet_len, p_metadata, CORE_TX_ROLE_RELAY);
    }
#endif

    /* All packets have arrived */
    if (p_sar_ctx->session.block_ack == block_ack_full(&p_sar_ctx->metadata))
    {
        if (!is_in_lpn_role())
        {
            /* Final ack. If it fails, we'll recover when the sender resends a segment. We'll find
             * the cached session and respond. */
            (void) sar_ack_send(&p_sar_ctx->metadata, p_sar_ctx->session.block_ack);
        }

#if MESH_FEATURE_FRIEND_ENABLED
        // Give the packet to the friend first, in case the app decides to send something as a response
        if (p_metadata->receivers & TRANSPORT_PACKET_RECEIVER_FRIEND)
        {
            friend_sar_complete(p_metadata->net.src, p_metadata->segmentation.seq_zero, true);
        }
#endif

        upper_transport_packet_in(p_sar_ctx->payload,
                                  p_sar_ctx->session.length,
                                  &p_sar_ctx->metadata,
                                  p_rx_metadata);

        sar_rx_session_mark_as_handled(&p_sar_ctx->metadata, true);
        sar_ctx_free(p_sar_ctx);
    }
}

static void trs_unseg_packet_in(const packet_mesh_trs_packet_t * p_packet,
                                uint32_t packet_len,
                                transport_packet_metadata_t * p_metadata,
                                const nrf_mesh_rx_metadata_t * p_rx_metadata)
{

#if MESH_FEATURE_FRIEND_ENABLED
    if (p_metadata->receivers & TRANSPORT_PACKET_RECEIVER_FRIEND)
    {
        friend_packet_in(p_packet, packet_len, p_metadata, CORE_TX_ROLE_RELAY);
    }
#endif

    upper_transport_packet_in(packet_mesh_trs_unseg_payload_get(p_packet),
                              packet_len - PACKET_MESH_TRS_UNSEG_PDU_OFFSET,
                              p_metadata,
                              p_rx_metadata);
}

static bool test_transport_decrypt(const nrf_mesh_application_secmat_t * p_app_security_material, ccm_soft_data_t * p_ccm_data)
{
    bool mic_passed = false;
    if (p_app_security_material != NULL)
    {
        p_ccm_data->p_key = p_app_security_material->key;
        enc_aes_ccm_decrypt(p_ccm_data, &mic_passed);
        if (mic_passed)
        {
            __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Message decrypted\n");
        }
    }
    return mic_passed;
}

static void upper_trs_packet_encrypt(const uint8_t * p_unencrypted_upper_trs_packet,
                                     uint8_t * p_encrypted_upper_trs_packet,
                                     uint32_t upper_trs_payload_len,
                                     const transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT(p_unencrypted_upper_trs_packet != NULL);
    NRF_MESH_ASSERT(p_encrypted_upper_trs_packet != NULL);
    NRF_MESH_ASSERT(p_metadata != NULL);

    ccm_soft_data_t ccm_data;
    ccm_data.p_key = p_metadata->p_security_material->key;

    uint8_t app_nonce_buf[CCM_NONCE_LENGTH];
    enc_nonce_generate(&p_metadata->net,
                       (p_metadata->type.access.using_app_key ? ENC_NONCE_APP : ENC_NONCE_DEV),
                       (p_metadata->mic_size == PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE),
                       app_nonce_buf);

    ccm_data.p_nonce = app_nonce_buf;
    ccm_data.p_m     = p_unencrypted_upper_trs_packet;
    ccm_data.m_len   = upper_trs_payload_len;
    ccm_data.p_out   = p_encrypted_upper_trs_packet;
    ccm_data.p_mic   = (uint8_t *) ccm_data.p_out + ccm_data.m_len;
    ccm_data.mic_len = p_metadata->mic_size;

    if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        NRF_MESH_ASSERT(p_metadata->net.dst.p_virtual_uuid != NULL);
        ccm_data.p_a   = p_metadata->net.dst.p_virtual_uuid;
        ccm_data.a_len = NRF_MESH_KEY_SIZE;
    }
    else
    {
        ccm_data.a_len = 0;
    }

    enc_aes_ccm_encrypt(&ccm_data);
}

static uint8_t mic_size_get(nrf_mesh_transmic_size_t encoded_mic_opt_val)
{
    return (encoded_mic_opt_val == NRF_MESH_TRANSMIC_SIZE_SMALL) ?
           PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE:
           PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE;
}

static void transport_metadata_from_tx_params(transport_packet_metadata_t * p_metadata,
                                              const nrf_mesh_tx_params_t * p_tx_params)
{
    p_metadata->type.access.app_key_id = p_tx_params->security_material.p_app->aid;
    p_metadata->type.access.using_app_key = (!p_tx_params->security_material.p_app->is_device_key);
    p_metadata->p_security_material = p_tx_params->security_material.p_app;

    /* Messages should be segmented if:
     * - They won't fit in an unsegmented message.
     * - The user explicitly requested it.
     * - The user forced a large MIC size.
     */
    p_metadata->segmented = ((p_tx_params->data_len > NRF_MESH_UNSEG_PAYLOAD_SIZE_MAX) ||
                             p_tx_params->force_segmented ||
                             p_tx_params->transmic_size == NRF_MESH_TRANSMIC_SIZE_LARGE);

