NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    if (p_metadata->segmented)
    {
        p_metadata->mic_size =
            mic_size_get((p_tx_params->transmic_size == NRF_MESH_TRANSMIC_SIZE_DEFAULT)
                             ? m_trs_config.szmic
                             : p_tx_params->transmic_size);

        uint32_t num_segments = ((p_tx_params->data_len + p_metadata->mic_size +
                                  PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE - 1) /
                                 PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE);
        p_metadata->segmentation.last_segment = num_segments - 1;
        p_metadata->segmentation.segment_offset = 0;
    }
    else
    {
        p_metadata->mic_size = PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE;
    }

    p_metadata->net.control_packet = false;
    p_metadata->net.dst = p_tx_params->dst;
    p_metadata->net.p_security_material = p_tx_params->security_material.p_net;
    p_metadata->net.src = p_tx_params->src;
    p_metadata->net.ttl = p_tx_params->ttl;
    p_metadata->token = p_tx_params->tx_token;
    p_metadata->tx_bearer_selector = CORE_TX_BEARER_TYPE_ALLOW_ALL ^ CORE_TX_BEARER_TYPE_LOCAL;

    if (nrf_mesh_is_address_rx(&p_tx_params->dst))
    {
        p_metadata->tx_bearer_selector = (p_tx_params->dst.type != NRF_MESH_ADDRESS_TYPE_UNICAST) ?
                CORE_TX_BEARER_TYPE_ALLOW_ALL : CORE_TX_BEARER_TYPE_LOCAL;
    }

#if MESH_FEATURE_FRIEND_ENABLED
    if (friend_needs_packet(p_metadata))
    {
        p_metadata->tx_bearer_selector |= CORE_TX_BEARER_TYPE_LOCAL;
    }
#endif
}

static void transport_metadata_from_control_tx_params(
    transport_packet_metadata_t * p_metadata,
    const transport_control_packet_t * p_tx_params,
    nrf_mesh_tx_token_t tx_token)
{
    p_metadata->type.control.opcode = p_tx_params->opcode;
    p_metadata->p_security_material = NULL;
    p_metadata->segmented = ((p_tx_params->data_len > PACKET_MESH_TRS_UNSEG_CONTROL_PDU_MAX_SIZE) ||
                             p_tx_params->reliable);
    p_metadata->mic_size = PACKET_MESH_TRS_TRANSMIC_CONTROL_SIZE;

    if (p_metadata->segmented)
    {
        uint32_t num_segments =
            ((p_tx_params->data_len + PACKET_MESH_TRS_SEG_CONTROL_PDU_MAX_SIZE - 1) /
             PACKET_MESH_TRS_SEG_CONTROL_PDU_MAX_SIZE);
        p_metadata->segmentation.last_segment = num_segments - 1;
        p_metadata->segmentation.segment_offset = 0;
    }

    p_metadata->net.control_packet      = true;
    p_metadata->net.dst                 = p_tx_params->dst;
    p_metadata->net.src                 = p_tx_params->src;
    p_metadata->net.p_security_material = p_tx_params->p_net_secmat;
    p_metadata->net.ttl                 = p_tx_params->ttl;
    p_metadata->tx_bearer_selector      = p_tx_params->bearer_selector;

    p_metadata->token = tx_token;
}

static uint32_t unsegmented_packet_tx(transport_packet_metadata_t * p_metadata,
                                      const uint8_t * p_payload,
                                      uint32_t payload_len)
{
    if (payload_len + p_metadata->mic_size > TRANSPORT_UNSEG_PDU_LEN(p_metadata->net.control_packet))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    network_tx_packet_buffer_t net_buf;

    uint8_t * p_packet_buffer_payload;
    uint32_t status = upper_trs_packet_alloc(p_metadata,
                                             &net_buf,
                                             payload_len + p_metadata->mic_size,
                                             &p_packet_buffer_payload);
    if (status == NRF_SUCCESS)
    {
        trs_packet_header_build(p_metadata, (packet_mesh_trs_packet_t *) net_buf.p_payload);

        if (p_metadata->net.control_packet)
        {
            memcpy(p_packet_buffer_payload, p_payload, payload_len);
        }
        else
        {
            upper_trs_packet_encrypt(p_payload, p_packet_buffer_payload, payload_len, p_metadata);
        }

        network_packet_send(&net_buf);
    }
    return status;
}

static uint32_t sar_segment_send(trs_sar_ctx_t * p_sar_ctx, uint32_t segment_index)
{
    uint32_t segment_len = TRANSPORT_SAR_PDU_LEN(p_sar_ctx->metadata.net.control_packet);
    uint32_t payload_offset = segment_len * segment_index;

    /* The last segment won't necessarily fill the whole length: */
    if (segment_index == p_sar_ctx->metadata.segmentation.last_segment)
    {
        segment_len = p_sar_ctx->session.length - payload_offset;
    }

    p_sar_ctx->metadata.segmentation.segment_offset = segment_index;
    network_tx_packet_buffer_t net_buf;
    uint8_t * p_segment_payload;
    uint32_t status = upper_trs_packet_alloc(&p_sar_ctx->metadata,
                                             &net_buf,
                                             segment_len,
                                             &p_segment_payload);
    if (status == NRF_SUCCESS)
    {
        if (segment_index == 0 && !p_sar_ctx->session.params.tx.seqzero_is_set)
        {
            p_sar_ctx->metadata.segmentation.seq_zero =
                (p_sar_ctx->metadata.net.internal.sequence_number & TRANSPORT_SAR_SEQZERO_MASK);
            p_sar_ctx->session.params.tx.seqzero_is_set = true;
        }
        /* The payload couldn't be encrypted before we allocated the first packet, as we needed to
         * allocate a seqnum and iv index for the nonce. */
        if (!p_sar_ctx->metadata.net.control_packet && !p_sar_ctx->session.params.tx.payload_encrypted)
        {
            NRF_MESH_ASSERT(segment_index == 0);

            upper_trs_packet_encrypt(p_sar_ctx->payload,
                                     p_sar_ctx->payload,
                                     p_sar_ctx->session.length - p_sar_ctx->metadata.mic_size,
                                     &p_sar_ctx->metadata);
            p_sar_ctx->session.params.tx.payload_encrypted = true;
        }

        trs_packet_header_build(&p_sar_ctx->metadata, (packet_mesh_trs_packet_t *) net_buf.p_payload);
        memcpy(p_segment_payload, &p_sar_ctx->payload[payload_offset], segment_len);
        network_packet_send(&net_buf);
    }

