NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    return status;
}

/**
 * Send SAR segments.
 *
 * @param[in,out] p_sar_ctx       SAR context to send segments of.
 * @param[out]    p_segment_count Number of segments successfully sent. Ignored if NULL.
 *
 * @retval NRF_SUCCESS Successfully sent all (remaining) segments.
 * @retval NRF_ERROR_NO_MEM No memory to sent all segments.
 * @return Other returns from lower layers. E.g., the network layer may disallow segment allocation
 * because there are no sequence number(s) available.
 */
static uint32_t trs_sar_packet_out(trs_sar_ctx_t * p_sar_ctx, uint32_t * p_segment_count)
{
    uint32_t status = NRF_SUCCESS;

    if (p_segment_count != NULL)
    {
        *p_segment_count = 0;
    }

    /* Starts at start_index if, e.g., there was no memory available last round. */
    for (uint8_t i = p_sar_ctx->session.params.tx.start_index;
         i <= p_sar_ctx->metadata.segmentation.last_segment;
         ++i)
    {
        if ((p_sar_ctx->session.block_ack & (1u << i)) == 0)
        {
            /* packet hasn't been acked yet */
            status = sar_segment_send(p_sar_ctx, i);
            if (status == NRF_SUCCESS)
            {
                if (p_segment_count != NULL)
                {
                    *p_segment_count = *p_segment_count + 1 ;
                }
                /* Set the start index to the next packet, so we know where to pick up in case
                 * of failure: */
                p_sar_ctx->session.params.tx.start_index = i + 1;
            }
            else
            {
                break;
            }
        }
    }

    return status;
}

static uint32_t segmented_packet_tx(const transport_packet_metadata_t * p_metadata,
                                    const uint8_t * p_payload,
                                    uint32_t payload_len)
{
    uint32_t packet_length = payload_len + p_metadata->mic_size;
    if (packet_length > TRANSPORT_SAR_PACKET_MAX_SIZE(p_metadata->net.control_packet))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    /* According to the Mesh Profile Specification v1.0 Section 3.6.4.1, we should only ever send one
     * transport SAR packet at the same time between a given source and destination. Return FORBIDDEN if
     * there's a SAR session in progress with the same parameters. */
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX &&
            m_trs_sar_sessions[i].metadata.net.src == p_metadata->net.src &&
            m_trs_sar_sessions[i].metadata.net.dst.value == p_metadata->net.dst.value)
        {
            return NRF_ERROR_INVALID_STATE;
        }
    }

    trs_sar_ctx_t * p_sar_ctx = sar_ctx_alloc(p_metadata, TRS_SAR_SESSION_TX, packet_length);
    if (p_sar_ctx == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }

    memcpy(p_sar_ctx->payload, p_payload, payload_len);

    uint32_t sent_segments = 0;
    uint32_t status = trs_sar_packet_out(p_sar_ctx, &sent_segments);
    if (status == NRF_SUCCESS ||
        status == NRF_ERROR_NO_MEM)
    {
        /* For NRF_ERROR_NO_MEM we assume there will be more memory available on the next
         * TX_COMPLETE event. */
        if (sent_segments > 0)
        {
            tx_retry_timer_reset(p_sar_ctx);
        }

        __LOG_XB(LOG_SRC_TRANSPORT,
                 LOG_LEVEL_INFO,
                 "TX:SAR packet",
                 p_sar_ctx->payload,
                 p_sar_ctx->session.length);

        return NRF_SUCCESS;
    }
    else
    {
        sar_ctx_free(p_sar_ctx);
        return status;
    }
}


/** Process ongoing SAR TX sessions. */
static void trs_sar_tx_process(void)
{
    /* Loop through all active sessions and (re-)transmit remaining packets. */
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX)
        {
            uint32_t sent_segments = 0;
            uint32_t status = trs_sar_packet_out(&m_trs_sar_sessions[i], &sent_segments);

            /* Assume that there will be available memory on the next TX_COMPLETE event. */
            if (status == NRF_ERROR_NO_MEM || sent_segments != 0)
            {
                tx_retry_timer_reset(&m_trs_sar_sessions[i]);
            }
        }
    }
}

static void trs_sar_rx_pending_ack_send(trs_sar_ctx_t * p_sar_ctx)
{
    if (p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX &&
        p_sar_ctx->session.params.rx.ack_state == SAR_ACK_STATE_PENDING)
    {
        if (sar_ack_send(&p_sar_ctx->metadata, p_sar_ctx->session.block_ack) == NRF_SUCCESS)
        {
            p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_IDLE;
        }
    }
}

static void trs_sar_rx_process(void)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        trs_sar_rx_pending_ack_send(&m_trs_sar_sessions[i]);
    }
}

static bool transport_sar_process(void)
{
    trs_sar_tx_process();
    trs_sar_rx_process();
    return true;
}

static uint32_t upper_trs_packet_decrypt(transport_packet_metadata_t * p_metadata,
                                         const uint8_t * p_upper_trs_packet,
                                         uint32_t upper_trs_packet_len,
                                         uint8_t * p_upper_trs_packet_out)
{
    /* Use seq_zero network sequence number if this is a segmented message */
    uint32_t old_network_seqnum = p_metadata->net.internal.sequence_number;
    if (p_metadata->segmented)
    {
        p_metadata->net.internal.sequence_number =
            seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                        p_metadata->segmentation.seq_zero);
    }
    /* Calculate nonce */
    uint8_t app_nonce_buf[CCM_NONCE_LENGTH];
    enc_nonce_generate(&p_metadata->net,
                       ((p_metadata->type.access.using_app_key) ? ENC_NONCE_APP : ENC_NONCE_DEV),
                       (p_metadata->mic_size == PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE),
                       app_nonce_buf);
    /* Reset the network sequence number to its original value, to keep a predictable state. */
    p_metadata->net.internal.sequence_number = old_network_seqnum;

    ccm_soft_data_t ccm_data;
    ccm_data.p_nonce = app_nonce_buf;
    ccm_data.p_m     = p_upper_trs_packet;
    ccm_data.m_len   = (upper_trs_packet_len - p_metadata->mic_size);
    ccm_data.p_mic   = (uint8_t *) ccm_data.p_m + ccm_data.m_len;
    ccm_data.p_out   = p_upper_trs_packet_out;
    ccm_data.mic_len = p_metadata->mic_size;
    ccm_data.a_len = 0;

