NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    if (p_metadata->type.access.using_app_key)
    {
        do {
            if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
            {
                ccm_data.a_len = NRF_MESH_UUID_SIZE;
                ccm_data.p_a = p_metadata->net.dst.p_virtual_uuid;
            }

            /* Application key */
            p_metadata->p_security_material = NULL;
            for (nrf_mesh_app_secmat_next_get(p_metadata->net.p_security_material,
                                              p_metadata->type.access.app_key_id,
                                              &p_metadata->p_security_material);
                 p_metadata->p_security_material != NULL;
                 nrf_mesh_app_secmat_next_get(p_metadata->net.p_security_material,
                                              p_metadata->type.access.app_key_id,
                                              &p_metadata->p_security_material))
            {
                if (test_transport_decrypt(p_metadata->p_security_material, &ccm_data))
                {
                    return NRF_SUCCESS;
                }
            }
        } while (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL &&
                 nrf_mesh_rx_address_get(p_metadata->net.dst.value, &p_metadata->net.dst));
    }
    else if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST) // Device keys can only be used for unicast addresses.
    {
        /* Device key */
        /* Device keys are always attached to a unicast address. Try the devkey of both the source and the destination address: */
        const uint16_t devkey_addrs[] = {
            p_metadata->net.dst.value,
            p_metadata->net.src
        };
        for (uint32_t i = 0; i < ARRAY_SIZE(devkey_addrs); ++i)
        {
            p_metadata->p_security_material = NULL;
            nrf_mesh_devkey_secmat_get(devkey_addrs[i], &p_metadata->p_security_material);
            if (test_transport_decrypt(p_metadata->p_security_material, &ccm_data))
            {
                return NRF_SUCCESS;
            }
        }
    }

    return NRF_ERROR_NOT_FOUND;
}

/**
 * Validate transport packet metadata for both incoming and outgoing packets.
 *
 * @param[in] p_trs_metadata Transport metadata to validate.
 *
 * @returns A status code for the result of the validation.
 */
static uint32_t transport_metadata_validate(const transport_packet_metadata_t * p_trs_metadata)
{
    if (nrf_mesh_address_type_get(p_trs_metadata->net.src) != NRF_MESH_ADDRESS_TYPE_UNICAST ||
        p_trs_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_INVALID)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    if (p_trs_metadata->net.ttl > NRF_MESH_TTL_MAX)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (p_trs_metadata->net.control_packet)
    {
        /* Mesh Profile Specification v1.0.1 Section 3.4.3: Only unicast and group destination addresses are valid for control packets */
        if (p_trs_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
        {
            return NRF_ERROR_INVALID_ADDR;
        }

        if ((uint8_t) p_trs_metadata->type.control.opcode > TRANSPORT_CONTROL_PACKET_OPCODE_MAX ||
            p_trs_metadata->mic_size != PACKET_MESH_TRS_TRANSMIC_CONTROL_SIZE)
        {
            return NRF_ERROR_INVALID_PARAM;
        }
    }
    else
    {
        /* Mesh Profile Specification v1.0.1 Section 3.4.3: Only unicast destination addresses are valid with device keys */
        if (!p_trs_metadata->type.access.using_app_key && p_trs_metadata->net.dst.type != NRF_MESH_ADDRESS_TYPE_UNICAST)
        {
            return NRF_ERROR_INVALID_PARAM;
        }

        if (!p_trs_metadata->segmented && p_trs_metadata->mic_size != PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE)
        {
            return NRF_ERROR_INVALID_PARAM;
        }
    }

    return NRF_SUCCESS;
}

static uint32_t transport_metadata_build(const packet_mesh_trs_packet_t * p_transport_packet,
                                         uint32_t packet_len,
                                         const network_packet_metadata_t * p_net_metadata,
                                         const nrf_mesh_rx_metadata_t * p_rx_metadata,
                                         transport_packet_metadata_t * p_trs_metadata)
{
    // Ensure that the read of the "seg" field isn't out of bounds:
    if (packet_len < PACKET_MESH_TRS_COMMON_SEG_OFFSET + 1)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    memcpy(&p_trs_metadata->net, p_net_metadata, sizeof(network_packet_metadata_t));
    p_trs_metadata->receivers = TRANSPORT_PACKET_RECEIVER_NONE; // will be filled in gradually
    p_trs_metadata->segmented = packet_mesh_trs_common_seg_get(p_transport_packet);

    // Ensure that the rest of the fields aren't out of bounds:
    uint32_t min_len = (p_trs_metadata->segmented ? PACKET_MESH_TRS_SEG_PDU_OFFSET : PACKET_MESH_TRS_UNSEG_PDU_OFFSET);
    if (packet_len < min_len)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    if (p_trs_metadata->net.control_packet)
    {
        p_trs_metadata->type.control.opcode = (transport_control_opcode_t) packet_mesh_trs_control_opcode_get(p_transport_packet);
        p_trs_metadata->mic_size = PACKET_MESH_TRS_TRANSMIC_CONTROL_SIZE;
    }
    else
    {
        p_trs_metadata->type.access.using_app_key = packet_mesh_trs_access_akf_get(p_transport_packet);
        p_trs_metadata->type.access.app_key_id = packet_mesh_trs_access_aid_get(p_transport_packet);
        if (p_trs_metadata->segmented)
        {
            p_trs_metadata->mic_size = ((packet_mesh_trs_seg_szmic_get(p_transport_packet)) ? PACKET_MESH_TRS_TRANSMIC_LARGE_SIZE : PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE);
        }
        else
        {
            p_trs_metadata->mic_size = PACKET_MESH_TRS_TRANSMIC_SMALL_SIZE;

            if (packet_len < min_len + p_trs_metadata->mic_size)
            {
                return NRF_ERROR_INVALID_LENGTH;
            }
        }
    }

    if (p_trs_metadata->segmented)
    {
        p_trs_metadata->segmentation.seq_zero       = packet_mesh_trs_seg_seqzero_get(p_transport_packet);
        p_trs_metadata->segmentation.segment_offset = packet_mesh_trs_seg_sego_get(p_transport_packet);
        p_trs_metadata->segmentation.last_segment   = packet_mesh_trs_seg_segn_get(p_transport_packet);
    }
    /* Not enough information to populate the secmat yet. */
    p_trs_metadata->p_security_material = NULL;

    /* Map RX source to the TX bearer we should use to send responses */
    static const core_tx_bearer_selector_t rx_source_to_tx_bearer[] = {
        [NRF_MESH_RX_SOURCE_SCANNER]    = CORE_TX_BEARER_TYPE_ADV,
        [NRF_MESH_RX_SOURCE_GATT]       = CORE_TX_BEARER_TYPE_GATT_SERVER,
        [NRF_MESH_RX_SOURCE_INSTABURST] = CORE_TX_BEARER_TYPE_ADV,
        [NRF_MESH_RX_SOURCE_LOOPBACK]   = CORE_TX_BEARER_TYPE_LOCAL,
    };
    NRF_MESH_ASSERT((uint32_t) p_rx_metadata->source < ARRAY_SIZE(rx_source_to_tx_bearer));
    p_trs_metadata->tx_bearer_selector = rx_source_to_tx_bearer[p_rx_metadata->source];

    return NRF_SUCCESS;
}

